OpenNuvoton/M2354BSP/SampleCode/SecureApplication/SecureOTADemo/NuBL32v2/NuBL32_startup_M2354.s
DEFAULT_IRQHandler
                B       .
                ENDP

                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
                LDR     R0, = Heap_Mem
                LDR     R1, = (Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
				BX      LR
                ENDP


                ALIGN

                ENDIF

;int32_t SH_DoCommand(int32_t n32In_R0, int32_t n32In_R1, int32_t *pn32Out_R0)
SH_DoCommand    PROC
    
                EXPORT      SH_DoCommand
                IMPORT      SH_Return
                    
                BKPT   0xAB                ; Wait ICE or HardFault
                LDR    R3, =SH_Return 
                MOV    R4, lr          
                BLX    R3                  ; Call SH_Return. The return value is in R0
                BX     R4                  ; Return value = R0
                
                ENDP

__PC            PROC
                EXPORT      __PC
                
                MOV     r0, lr
                BLX     lr
                ALIGN
                    
                ENDP

SPD_Return      PROC
                EXPORT  SPD_Return
                
                LDR     r0, =0x400002c0 ; SPD_VTOR
                LDR     r1, =0x20010000    ; New VTOR
                STR     r1, [r0]
                MOV     r0, sp
                STR     r0, [r1]
                LDR     r0, =SPD_Next
                STR     r0, [r1,#4]
                WFI
                B       .
                ;LDR     SPD_Next
SPD_Next                        
                NOP
                NOP
                NOP
                
                ENDP


                END
